package autoCatalogProgram;

public class K5럭셔리 extends 자동차 {

	
	public void K5럭셔리스펙() {// 생성자
		
		기본가격=2228; // 기본가격
		
		 브랜드 = "기아"; // 브랜드
		 모델  = "K5"; // 모델
		 등급 = "2.0 럭셔리"; // 등급
		 엔진종류 = "누우 2.0 CVVL 가솔린"; // 엔진종류
		 최대출력 = "163 / 6,500"; // 최대출력
		 최대토크 = "20.0 / 4,800"; // 최대토크
		 미션= "6단 A/T"; // 변속기
		 타이어 = "16인치"; // 타이어
		 차체중량 = "1,455"; // 차체중량
		 연비 = "12.3"; // 연비
		 승차인원 = "5"; // 승차인원
		 에어백= "있음"; // 에어백
		 크루즈컨트롤 = "없음"; // 크루즈컨트롤
		 차세제어장치 = "있음"; // 차세제어장치
		 LED램프 = "없음"; // LED램프
		 주간주행등 = "있음"; // 주간주행등
		 머플러 = "싱글"; // 머플러
		 스티어링휠 = "합성소재"; // 스티어링휠
		 기어노브= "합성소재"; // 기어노브
		 계기판 = "3.5인치 모노 TFT LCD"; // 계기판
		 앞좌석전동시트 = "없음"; // 앞좌석 전동시트
		 앞좌석열선시트 = "있음"; // 앞좌석 열선시트
		 앞좌석통풍시트 = "없음"; // 앞좌석 통풍시트
		 풀오토에어컨 = "없음"; // 풀오토 에어컨
		 스마트키 = "없음"; // 스마트키
		 ECM룸미러 = "없음"; // ECM룸미러
		 네비게이션 = "없음";// 네비게이션
		 블루투스 = "있음"; // 블루투스
		
		 추가옵션1 = "스마트키"; // 추가선택옵션1
		 추가옵션1가격 = 64; // 추가선택옵션1의 가격
		 추가옵션2= "파노라마 썬루프"; // 추가선택옵션1
		 추가옵션2가격= 113; // 추가선택옵션1의 가격
		 추가옵션3= "앞좌석 통풍시트"; // 추가선택옵션1
		 추가옵션3가격 = 39; // 추가선택옵션1의 가격

		 
		 선택한추가옵션1 = "";
		 선택한추가옵션2 = "";
		 선택한추가옵션3 = "";

		}
		

}
