package autoCatalogProgram;

public class K5인텔리전트 extends 자동차 {

	
	public void K5인텔리전트스펙() {// 생성자
		
		기본가격 = 2930;
		
		 브랜드 = "기아";
		 모델 = "K5";
		 등급 = "2.0 인텔리전트";
		 엔진종류 = "누우 2.0 CVVL 가솔린";
		 최대출력 = "163 / 6,500";
		 최대토크 = "20.0 / 4,800";
		 미션 = "6단 A/T";
		 타이어 = "18인치";
		 차체중량 = "1,475";
		 연비 = "11.6";
		 승차인원 = "5";
		 에어백 = "있음";
		 크루즈컨트롤 = "스마트 크루즈컨트롤";
		 차세제어장치 = "있음";
		 LED램프 = "있음";
		 주간주행등 = "있음";
		 머플러 = "싱글";
		 스티어링휠 = "가죽";
		 기어노브 = "가죽";
		 계기판 = "4.3인치 칼라 TFT LCD";
		 앞좌석전동시트 = "있음";
		 앞좌석열선시트 = "있음";
		 앞좌석통풍시트= "있음";
		 풀오토에어컨= "있음";
		 스마트키 = "있음";
		 ECM룸미러 = "있음";
		 네비게이션 = "없음";
		 블루투스 = "있음";
		
		 추가옵션1 = "스마트 네비게이션";
		 추가옵션1가격 = 157;
		 추가옵션2 = "파노라마 썬루프";
		 추가옵션2가격 = 113;
		 추가옵션3 = "화이트 스노우펄 색상";
		 추가옵션3가격 = 8;

		 
		 선택한추가옵션1 = "";
		 선택한추가옵션2 = "";
		 선택한추가옵션3 = "";

		}
		

}
