package autoCatalogProgram;

public class 그랜저IG프리미엄 extends 자동차 {

	public void 그랜저IG프리미엄스펙() {
	
	기본가격=3495; // 기본가격
	
	 브랜드 = "현대";
	 모델 = "그랜저IG";
	 등급 = "3.0 프리미엄";
	 엔진종류 = "가솔린 3.0";
	 최대출력 = "266 / 6,400";
	 최대토크 = "31.4 /5,300";
	 미션 = "8단 A/T";
	 타이어 = "18인치";
	 차체중량 = "1,630";
	 연비 = "10.1";
	 승차인원 = "5";
	 에어백 = "있음";
	 크루즈컨트롤 = "스마트 크루즈컨트롤";
	 차세제어장치 = "있음";
	 LED램프 = "있음";
	 주간주행등 = "있음";
	 머플러 = "듀얼머플러";
	 스티어링휠 = "가죽";
	 기어노브 = "가죽";
	 계기판 = "4.2인치 클러스터 LCD";
	 앞좌석전동시트 = "있음";
	 앞좌석열선시트 = "있음";
	 앞좌석통풍시트 = "있음";
	 풀오토에어컨 = "있음";
	 스마트키 = "있음";
	 ECM룸미러 = "있음";
	 네비게이션 = "순정 8인치";
	 블루투스 = "있음";
	
	 추가옵션1 = "화이트크림 외장컬러";
	 추가옵션1가격 = 10;
	 추가옵션2 = "헤드업 디스플레이";
	 추가옵션2가격 = 98;
	 추가옵션3 = "파노라마썬루프";
	 추가옵션3가격 = 108;

	 
	 선택한추가옵션1 = "";
	 선택한추가옵션2 = "";
	 선택한추가옵션3 = "";

	}
	


}
