package autoCatalogProgram;

public class 싼타페TM모던 extends 자동차 {

public void 싼타페TM모던스펙() {
		
		기본가격 = 2842;
		
		 브랜드 = "현대";
		 모델 = "싼타페 TM";
		 등급 = "2.0 모던";
		 엔진종류 = "디젤 2.0";
		 최대출력 = "186 / 4,000";
		 최대토크 = "41.0 / 1,750~2,750";
		 미션 = "8단 A/T";
		 타이어 = "18인치";
		 차체중량 = "1,795";
		 연비 = "13.8";
		 승차인원 = "5";
		 에어백 = "있음";
		 크루즈컨트롤 = "없음";
		 차세제어장치= "있음";
		 LED램프 = "있음";
		 주간주행등 = "있음";
		 머플러 = "싱글 트윈팁";
		 스티어링휠 = "합성소재";
		 기어노브 = "합성소재";
		 계기판 = "3.5인치 모노 LCD";
		 앞좌석전동시트 = "없음";
		 앞좌석열선시트 = "없음";
		 앞좌석통풍시트 = "없음";
		 풀오토에어컨 = "없음";
		 스마트키 = "없음";
		 ECM룸미러 = "없음";
		 네비게이션 = "없음";
		 블루투스 = "있음";
		
		 추가옵션1 = "화이트크림 외장컬러";
		 추가옵션1가격 = 8;
		 추가옵션2 = "8인치 순정 네비게이션";
		 추가옵션2가격 = 177;
		 추가옵션3 = "현대 스마트센스1";
		 추가옵션3가격 = 103;

		 
		 선택한추가옵션1 = "";
		 선택한추가옵션2 = "";
		 선택한추가옵션3 = "";

		}
		
	
	
}
