package autoCatalogProgram;

public class 싼타페TM프레스티지 extends 자동차 {

public void 싼타페TM프레스티지스펙() {
		
		기본가격 = 3632;
		
		 브랜드 = "현대";
		 모델 = "싼타페 TM";
		 등급 = "2.0 프레스티지";
		 엔진종류 = "디젤 2.0";
		 최대출력 = "186 / 4,000";
		 최대토크 = "41.0 / 1,750~2,750";
		 미션 = "8단 A/T";
		 타이어 = "19인치";
		 차체중량 = "1,850";
		 연비 = "13.1";
		 승차인원 = "7";
		 에어백 = "있음";
		 크루즈컨트롤 = "스마트 크루즈컨트롤";
		 차세제어장치 = "있음";
		 LED램프 = "있음";
		 주간주행등 = "있음";
		 머플러 = "싱글 트윈팁";
		 스티어링휠 = "가죽";
		 기어노브 = "가죽";
		 계기판 = "3.5인치 모노 LCD";
		 앞좌석전동시트 = "있음";
		 앞좌석열선시트 = "있음";
		 앞좌석통풍시트 = "있음";
		 풀오토에어컨 = "있음";
		 스마트키 = "있음";
		 ECM룸미러 = "있음";
		 네비게이션 = "순정 8인치";
		 블루투스 = "있음";
		
		 추가옵션1 = "화이트크림 외장컬러";
		 추가옵션1가격 = 8;
		 추가옵션2 = "파노라마 썬루프 + LED 실내등";
		 추가옵션2가격 = 113;
		 추가옵션3 = "테크 플러스";
		 추가옵션3가격 = 123;

		 
		 선택한추가옵션1 = "";
		 선택한추가옵션2 = "";
		 선택한추가옵션3 = "";

		}
	
	
	
}
