package autoCatalogProgram;

public class 쏘렌토마스터 extends 자동차 {

public void 쏘렌토마스터스펙() {// 생성자
		
		기본가격 = 3578;
		
		 브랜드 = "기아";
		 모델 = "쏘렌토";
		 등급 = "2.0 마스터";
		 엔진종류 = "디젤 2.0";
		 최대출력 = "186 / 4,000";
		 최대토크 = "41 / 1,750~2,750";
		 미션 = "8단 A/T";
		 타이어 = "19인치";
		 차체중량 = "1,910";
		 연비 = "13.1";
		 승차인원 = "7";
		 에어백 = "있음";
		 크루즈컨트롤 = "스마트 크루즈컨트롤";
		 차세제어장치 = "있음";
		 LED램프 = "있음";
		 주간주행등 = "있음";
		 머플러 = "싱글 트윈팁";
		 스티어링휠 = "가죽";
		 기어노브 = "하이그로시";
		 계기판 = "3.5인치 모노 TFT LCD";
		 앞좌석전동시트 = "있음";
		 앞좌석열선시트 = "있음";
		 앞좌석통풍시트 = "있음";
		 풀오토에어컨 = "있음";
		 스마트키 = "있음";
		 ECM룸미러 = "있음";
		 네비게이션 = "순정 8인치";
		 블루투스 = "있음";
		
		 추가옵션1 = "파노라마 썬루프";
		 추가옵션1가격 = 177;
		 추가옵션2 = "하이테크 업 패키지";
		 추가옵션2가격 = 108;
		 추가옵션3 = "프리미엄 팩";
		 추가옵션3가격 = 93;

		 
		 선택한추가옵션1 = "";
		 선택한추가옵션2 = "";
		 선택한추가옵션3 = "";

		}
	
	
	
}
