package autoCatalogProgram;

public class 쏘렌토럭셔리 extends 자동차 {

public void 쏘렌토럭셔리스펙() {// 생성자
		
		기본가격 = 2788;
		
		 브랜드 = "기아";
		 모델 = "쏘렌토";
		 등급 = "2.0 럭셔리";
		 엔진종류 = "디젤 2.0";
		 최대출력 = "186 / 4,000";
		 최대토크 = "41 / 1,750~2,750";
		 미션 = "8단 A/T";
		 타이어 = "18인치";
		 차체중량 = "1,825";
		 연비 = "13.8";
		 승차인원 = "5";
		 에어백 = "있음";
		 크루즈컨트롤 = "있음";
		 차세제어장치 = "있음";
		 LED램프 = "없음";
		 주간주행등 = "있음";
		 머플러 = "싱글 트윈팁";
		 스티어링휠 = "합성소재";
		 기어노브 = "합성소재";
		 계기판 = "3.5인치 모노 TFT LCD";
		 앞좌석전동시트 = "없음";
		 앞좌석열선시트 = "있음";
		 앞좌석통풍시트 = "없음";
		 풀오토에어컨 = "없음";
		 스마트키 = "없음";
		 ECM룸미러 = "없음";
		 네비게이션 = "없음";
		 블루투스 = "있음";
		
		 추가옵션1 = "스마트 네비게이션";
		 추가옵션1가격 = 177;
		 추가옵션2 = "컴포트 패키지";
		 추가옵션2가격 = 29;
		 추가옵션3 = "화이트 스노우펄 색상";
		 추가옵션3가격 = 8;

		 
		 선택한추가옵션1 = "";
		 선택한추가옵션2 = "";
		 선택한추가옵션3 = "";

		}
	
	
	
}
